minutes = int(input('number of minutes: '))
# ИСПОЛЬЗОВАТЬ везде: PEP 8 не рекомендует отделять скобки вызова от имени функции
# ИСПРАВИТЬ: вывод не соответствует требуемому формату (язык)
print(f'{minutes} minutes = {minutes // 60} hours {minutes % 60} minutes')
# КОММЕНТАРИЙ: в случае если вы будете генерировать строку не для человека, а для другой функции/класса/программы — это может стоить вам неработающего приложения


# ИСПОЛЬЗОВАТЬ везде: PEP 8 рекомендует добавлять пробелы после символа # — в большинстве редакторов кода, включая Notepad++, это делает команда "Вкл./Выкл. комментарий"
# number of minutes: 500
# 500 minutes = 8 hours 20 minutes


# ИТОГ: хорошо, доработать — 2/3
